CATEGORIES: dict[int, str] = {
    1: 'категория 1',
    2: 'категория 2',
    3: 'категория 3',
}

SUBCATEGORIES: dict[int, tuple] = {
    1: ('Подкатегория 1', 1),
    2: ('Подкатегория 2', 1),
    3: ('Подкатегория 1', 2),
    4: ('Подкатегория 2', 2),
    5: ('Подкатегория 1', 3),
    6: ('Подкатегория 2', 3),
}

GOODS: dict[int, tuple] = {
    1: ('Товар 1', 1, 100, 'Описание товара 1', 'размер', 3),
    2: ('Товар 2', 1, 200, 'Описание товара 2', 'размер', 2),
    3: ('Товар 3', 2, 300, 'Описание товара 3', 'размер', 5),
    4: ('Товар 4', 3, 400, 'Описание товара 4', 'размер', 1),
    5: ('Товар 2', 4, 500, 'Описание товара 5', 'размер', 1),
    6: ('Товар 3', 5, 600, 'Описание товара 6', 'размер', 2),
    7: ('Товар 4', 6, 700, 'Описание товара 7', 'размер', 2),
}

SAMPLE_PRODUCTS1 = (
            (1, "Продукт №1", 100, "Описание продукта №1", "категория 1",True),
            (2, "Продукт №2", 200, "Описание продукта №2", "категория 1",False),
            (3, "Продукт №3", 300, "Описание продукта №3", "категория 2",True),
            (4, "Продукт №4", 400, "Описание продукта №4", "категория 2",True),
            (5, "Продукт №5", 500, "Описание продукта №5", "категория 3", False),
            (6, "Продукт №6", 500, "Описание продукта №6", "категория 3", False),
            (7, "Продукт №7", 500, "Описание продукта №7", "категория 3", True),
)

SAMPLE_PRODUCTS = (1, "Продукт №1", 100, "Описание продукта №1", "категория 1",True)